Revit 2027 API
ControlledApplication.LinkedResourceOpening Event
 Subscribe to the LinkedResourceOpening event to be notified when Revit is just about to open a linked resource.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<LinkedResourceOpeningEventArgs> LinkedResourceOpening
Public Event LinkedResourceOpening As EventHandler(Of LinkedResourceOpeningEventArgs)
public:
 event EventHandler<LinkedResourceOpeningEventArgs^>^ LinkedResourceOpening {
	void add (EventHandler<LinkedResourceOpeningEventArgs^>^ value);
	void remove (EventHandler<LinkedResourceOpeningEventArgs^>^ value);
}
member LinkedResourceOpening : IEvent<EventHandler<LinkedResourceOpeningEventArgs>,
    LinkedResourceOpeningEventArgs>
Value
EventHandler<LinkedResourceOpeningEventArgs>
Remarks
This event is raised when Revit is just about to open a linked resource. Only supports linked resources for following types : Revit; IFC; CAD(dwg, dxf, dgn, sat); This event would not be raised if there are no update on linked CAD, IFC resources.
Event is not cancellable.
The linked resource cannot be modified, for it is not opened yet at the time of the event.
Another LinkedResourceOpened event will be raised immediately after linked resource is opened.
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace